tutorials/fsi/cylinderFlap_FSI1/fluid/constant/turbulenceProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 root "";
 case "";
 instance "";
 local "";
 class dictionary;
 object turbulenceProperties;
}

simulationType laminar;

