tutorials/fsi/cylinderFlap_FSI1/fluid/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 root "";
 case "";
 instance "";
 local "";
 class dictionary;
 object controlDict;
}

application fsiFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 1;

deltaT 1;

writeControl runTime;

writeInterval 0.01;

purgeWrite 0;

writeFormat ascii;

writePrecision 14;

writeCompression uncompressed;

timeFormat general;

timePrecision 8;

runTimeModifiable no;

adjustTimeStep no;

maxCo 0.2;

libs ( "libforces.so" );

functions
{
    forces
    {
        type                forces;
        functionObjectLibs  ( "libforces.so" );
        outputControl       timeStep;
        outputInterval      1;
        patches             (plate cylinder);
        pName               p;
        UName               U;
        rhoName             rhoInf;
        log                 true;
        rhoInf              1000;
        CofR                (0 0 0);
    }
}
