tutorials/fsi/cylinderFlap_FSI1/fluid/system/fvSchemes
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 root "";
 case "";
 instance "";
 local "";
 class dictionary;
 object fvSchemes;
}

ddtSchemes
{
  default steadyState;
}

gradSchemes
{
  default Gauss linear ;
} 	//default cellLimited Gauss linear 1;

divSchemes
{
  default none;
  div(phi,U) Gauss skewCorrected linear ; 	//div(phi,U) Gauss linearUpwind Gauss linear;//div(phi,U) Gauss linear limited 1.0;
  div((nuEff*dev(grad(U).T()))) Gauss linear ;
  div(U) Gauss linear;
}

laplacianSchemes
{
  default Gauss linear corrected ;
} 	//default Gauss linear limited 0.5;

interpolationSchemes
{
  default skewCorrected linear ;
} 	//default linear limited 1.0;//default linear;

snGradSchemes
{
  default corrected;
} 	//default limited 0.5;

fluxRequired
{
  default no;
  p /* empty */ ;
}
