tutorials/fsi/cylinderFlap_FSI1/fluid/system/fvSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 root "";
 case "";
 instance "";
 local "";
 class dictionary;
 object fvSolution;
}

solvers
{

  p
  {
    solver           PCG;
    preconditioner   DIC;
    tolerance        1e-14;
    relTol           1.0e-3;
  }

  U
  {
    solver BiCGStab;
    preconditioner DILU;
    tolerance 1e-14;
  }
}


PIMPLE
{
    nCorrectors 5;
    nNonOrthogonalCorrectors 0;
    tolerance 1.0e-13;
    relTol 1.0e-5;
    maxIter 20;
    minIter 1;
}

relaxationFactors
{
  U 0.9;
}
